Autodesk.Revit.DB.TriangleInShellComponent.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex2
Index of the triangle's third vertex in the TriangulatedShellComponent's array of vertices.
Since:
2013

Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex1
Index of the triangle's second vertex in the TriangulatedShellComponent's array of vertices.
Since:
2013

Autodesk.Revit.DB.TriangleInShellComponent.VertexIndex0
Index of the triangle's first vertex in the TriangulatedShellComponent's array of vertices.
Since:
2013

Autodesk.Revit.DB.TriangleInShellComponent.#ctor(Autodesk.Revit.DB.TriangleInShellComponent)
Creates a copy of the given TriangleInShellComponent
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.TriangleInShellComponent
This class represents a triangle in a TriangulatedShellComponent object. The triangle is
defined by its vertices, which are specified by their indices in the
TriangulatedShellComponent's array of vertices.
Remarks:
A TriangulatedShellComponent stores an array of TriangleInShellComponent objects
representing the triangles of the triangulation. An external class is used
because the API does not allow the use of a triple of integers. Note that a
TriangleInShellComponent must only be used in the context of a single, fixed
TriangulatedShellComponent.
Since:
2013